### Dataset download

In [106]:
import kagglehub
import os
import pandas as pd
import numpy as np
import shutil

download_folder = 'datasets'
os.makedirs(download_folder, exist_ok=True)
path = kagglehub.dataset_download("arnabchaki/data-science-salaries-2023")

if os.path.exists(path) and not os.path.exists(os.path.join(download_folder, "1")):
    shutil.move(path, download_folder)

csv_file_path = os.path.join(download_folder, "1/ds_salaries.csv")
data = pd.read_csv(csv_file_path)

Downloading from https://www.kaggle.com/api/v1/datasets/download/arnabchaki/data-science-salaries-2023?dataset_version_number=1...

100%|██████████| 25.4k/25.4k [00:00<00:00, 1.04MB/s]

Extracting files...

In [107]:
d = {'Paris': 100, "London": 34}
cities = pd.Series(d)
cities[cities<100] * 3

London    102
dtype: int64

In [183]:
data.tail(2)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
3753,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
3754,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L

In [109]:
data.shape, data.columns, data.dtypes

((3755, 11),
 Index(['work_year', 'experience_level', 'employment_type', 'job_title',
        'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
        'remote_ratio', 'company_location', 'company_size'],
       dtype='object'),
 work_year              int64
 experience_level      object
 employment_type       object
 job_title             object
 salary                 int64
 salary_currency       object
 salary_in_usd          int64
 employee_residence    object
 remote_ratio           int64
 company_location      object
 company_size          object
 dtype: object)

In [112]:
data[['work_year', 'experience_level', 'salary', 'company_location']].head(2)

   work_year experience_level  salary company_location
0       2023               SE   80000               ES
1       2023               MI   30000               US

In [113]:
data.iloc[0:3, 1:5]

  experience_level employment_type                 job_title  salary
0               SE              FT  Principal Data Scientist   80000
1               MI              CT               ML Engineer   30000
2               MI              CT               ML Engineer   25500

In [116]:
data[(data["salary"] > 500000) & (data['company_location'] == "US")]

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
1918,2022,MI,FT,Data Scientist,2500000,INR,31795,IN,100,US,M
3574,2021,MI,FT,BI Data Analyst,11000000,HUF,36259,HU,50,US,L
3649,2021,SE,FT,Data Science Manager,4000000,INR,54094,IN,50,US,L

In [117]:
data.describe(include=[object])

,experience_level,employment_type,job_title,salary_currency,employee_residence,company_location,company_size
count,3755,3755,3755,3755,3755,3755,3755
unique,4,4,93,20,78,72,3
top,SE,FT,Data Engineer,USD,US,US,M
freq,2516,3718,1040,3224,3004,3040,3153

In [120]:
data["experience_level"].value_counts(normalize=True)

experience_level
SE    0.670040
MI    0.214381
EN    0.085220
EX    0.030360
Name: proportion, dtype: float64

In [125]:
data[['salary', 'salary_in_usd']].corr()

                 salary  salary_in_usd
salary         1.000000      -0.023676
salary_in_usd -0.023676       1.000000

In [170]:
data.groupby(['experience_level', 'job_title'])[['salary_in_usd']].mean().head()

                                                salary_in_usd
experience_level job_title
EN               3D Computer Vision Researcher   35000.000000
                 AI Developer                   130884.500000
                 AI Programmer                   55000.000000
                 AI Scientist                    52781.285714
                 Analytics Engineer             130000.000000

In [195]:
data.groupby(['experience_level', 'job_title']).agg({
    "salary_in_usd":[('min', min), ('max', max), ('mean', lambda x: sum(x)/len(x))]}
    ).head()

C:\Users\vladk\AppData\Local\Temp\ipykernel_17000\279516375.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  data.groupby(['experience_level', 'job_title']).agg({
C:\Users\vladk\AppData\Local\Temp\ipykernel_17000\279516375.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  data.groupby(['experience_level', 'job_title']).agg({

                                               salary_in_usd          \
                                                         min     max
experience_level job_title
EN               3D Computer Vision Researcher         20000   50000
                 AI Developer                           6304  300000
                 AI Programmer                         40000   70000
                 AI Scientist                          12000  200000
                 Analytics Engineer                   130000  130000


                                                         mean
experience_level job_title
EN               3D Computer Vision Researcher   35000.000000
                 AI Developer                   130884.500000
                 AI Programmer                   55000.000000
                 AI Scientist                    52781.285714
                 Analytics Engineer             130000.000000

In [196]:
experience_level = {'SE':1, 'MI':2, "EN":3, "EX":4}
data.insert(loc=2, column='experience_level_id', 
            value = data['experience_level'].map(experience_level, na_action='ignore'))

In [197]:
data.head()

,work_year,experience_level,experience_level_id,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,1,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,2,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,2,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,1,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,1,FT,Data Scientist,120000,USD,120000,CA,100,CA,M